app/Http/Controllers/ApiController.php

    public function ViewMarkerIkan()
    {
        $result = kelompok_ikan::select('pokdakans.nama as nama_kelompok','alamat','jumlah_anggota','luas_lahan',
        'total_omzet','no_hp','pokdakans.email','prestasi','longitude','latitude','photo','pokdakans.slug','status'
        ,'kecamatans.nama as kecamatan_nama',
        'users.name as user_nama','pokdakans.id as id_kelompok','ikans.nama as ikan_nama','ikans.slug as ikan_slug','ikans.warna')
        ->leftJoin('pokdakans', 'kelompok_ikans.kelompok_id', '=', 'pokdakans.id')
        ->leftJoin('kecamatans', 'pokdakans.kecamatan_id', '=', 'kecamatans.id')
        ->join('ikans', 'kelompok_ikans.ikan_id', '=', 'ikans.id')
        ->leftJoin('users', 'pokdakans.user_id', '=', 'users.id')
        ->where('pokdakans.status', '=', 'disetujui')
        ->get()->toArray();
---
SELECT `pokdakans`.`nama` as `nama_kelompok`, `alamat`, `jumlah_anggota`, `luas_lahan`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `kecamatans`.`nama` as `kecamatan_nama`, `users`.`name` as `user_nama`, `pokdakans`.`id` as `id_kelompok`, `ikans`.`nama` as `ikan_nama`, `ikans`.`slug` as `ikan_slug`, `ikans`.`warna` FROM `kelompok_ikans` left join `pokdakans` on `kelompok_ikans`.`kelompok_id` = `pokdakans`.`id` left join `kecamatans` on `pokdakans`.`kecamatan_id` = `kecamatans`.`id` inner join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` left join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `pokdakans`.`status` = 'disetujui'

    public function ViewMarkerKategori()
    {
        $result = kelompok_kategori::select('pokdakans.nama as nama_kelompok','alamat','jumlah_anggota','luas_lahan',
        'total_omzet','no_hp','pokdakans.email','prestasi','longitude','latitude','photo',
        'pokdakans.slug','status',
        'kecamatans.nama as kecamatan_nama',
        'categories.nama as category_nama','categories.warna',
        'users.name as user_nama',
        'pokdakans.id as id_kelompok')
        ->leftJoin('pokdakans', 'kelompok_kategoris.kelompok_id', '=', 'pokdakans.id')
        ->leftJoin('categories', 'categories.id', '=', 'kelompok_kategoris.kategori_id')
        ->leftJoin('kecamatans', 'pokdakans.kecamatan_id', '=', 'kecamatans.id')
        ->leftJoin('users', 'pokdakans.user_id', '=', 'users.id')
        ->where('pokdakans.status', '=', 'disetujui')
        ->get()->toArray();
---
SELECT `pokdakans`.`nama` as `nama_kelompok`, `alamat`, `jumlah_anggota`, `luas_lahan`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `kecamatans`.`nama` as `kecamatan_nama`, `categories`.`nama` as `category_nama`, `users`.`name` as `user_nama`, `pokdakans`.`id` as `id_kelompok` FROM `pokdakans` inner join `kecamatans` on `pokdakans`.`kecamatan_id` = `kecamatans`.`id` inner join `categories` on `pokdakans`.`category_id` = `categories`.`id` inner join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `pokdakans`.`status` = 'disetujui'
SELECT `pokdakans`.`nama` as `nama_kelompok`, `alamat`, `jumlah_anggota`, `luas_lahan`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `kecamatans`.`nama` as `kecamatan_nama`, `categories`.`nama` as `category_nama`, `categories`.`warna`, `users`.`name` as `user_nama`, `pokdakans`.`id` as `id_kelompok` FROM `kelompok_kategoris` left join `pokdakans` on `kelompok_kategoris`.`kelompok_id` = `pokdakans`.`id` left join `categories` on `categories`.`id` = `kelompok_kategoris`.`kategori_id` left join `kecamatans` on `pokdakans`.`kecamatan_id` = `kecamatans`.`id` left join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `pokdakans`.`status` = 'disetujui'

    public function getDataByKategori($slug_category)
    {
    //    $Data = DB::select("select p.slug, p.nama as nama_kelompok, p.status, p.photo, p.updated_at, p.excerpt,
    //             u.name as petugas,u.username as username,
    //             i.nama as ikan_nama , i.slug as slug_ikan,
    //             c.nama as category_nama, c.slug as slug_category
    //             from ikans i,categories c,pokdakans p, users u
    //             where i.id = p.ikan_id and c.id = p.category_id and u.id = p.user_id and p.status = 'Disetujui' and c.slug = '$slug_category' ORDER BY p.updated_at DESC");

    //     return $Data;
        $result = kelompok_kategori::select('pokdakans.nama as nama_kelompok','alamat','jumlah_anggota','luas_lahan',
        'total_omzet','no_hp','pokdakans.email','prestasi','longitude','latitude','photo',
        'pokdakans.slug','status','pokdakans.updated_at',
        'kecamatans.nama as kecamatan_nama',
        'categories.nama as category_nama','categories.warna',
        'users.name as petugas',
        'pokdakans.id as id_kelompok')
        ->leftJoin('pokdakans', 'kelompok_kategoris.kelompok_id', '=', 'pokdakans.id')
        ->leftJoin('categories', 'categories.id', '=', 'kelompok_kategoris.kategori_id')
        ->leftJoin('kecamatans', 'pokdakans.kecamatan_id', '=', 'kecamatans.id')
        ->leftJoin('users', 'pokdakans.user_id', '=', 'users.id')
        ->where('pokdakans.status', '=', 'disetujui')
        ->where('categories.slug', '=', $slug_category)
        ->get()->toArray();
---
SELECT `pokdakans`.`nama` as `nama_kelompok`, `alamat`, `jumlah_anggota`, `luas_lahan`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `pokdakans`.`updated_at`, `kecamatans`.`nama` as `kecamatan_nama`, `categories`.`nama` as `category_nama`, `categories`.`warna`, `users`.`name` as `petugas`, `pokdakans`.`id` as `id_kelompok` FROM `kelompok_kategoris` left join `pokdakans` on `kelompok_kategoris`.`kelompok_id` = `pokdakans`.`id` left join `categories` on `categories`.`id` = `kelompok_kategoris`.`kategori_id` left join `kecamatans` on `pokdakans`.`kecamatan_id` = `kecamatans`.`id` left join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `pokdakans`.`status` = 'disetujui' and `categories`.`slug` = 'pembesaran-dan-pembenihan'

    public function getDataByIkan($slug_ikan)
    {
       $Data = DB::select("select p.slug, p.nama as nama_kelompok, p.status, p.photo, p.updated_at, p.excerpt,
                u.name as petugas,u.username as username,
                i.nama as ikan_nama , i.slug as slug_ikan,
                c.nama as category_nama, c.slug as slug_category
                from ikans i,categories c,pokdakans p, users u
                where i.id = p.ikan_id and c.id = p.category_id and u.id = p.user_id and p.status = 'Disetujui' and i.slug = '$slug_ikan' ORDER BY p.updated_at DESC");

        // return $Data;
        $result = DB::table('kelompok_ikans')
        ->select('pokdakans.nama as nama_kelompok','alamat','jumlah_anggota','luas_lahan','pokdakans.updated_at','excerpt',
        'total_omzet','no_hp','pokdakans.email','prestasi','longitude','latitude','photo','pokdakans.slug','status',
        'kecamatans.nama as kecamatan_nama',
        'categories.nama as category_nama','categories.slug as category_slug',
        'users.name as nama_petugas','users.username',
        'pokdakans.id as id_kelompok',
        'ikans.nama as ikan_nama','ikans.slug as ikan_slug')
        ->leftJoin('pokdakans', 'kelompok_ikans.kelompok_id', '=', 'pokdakans.id')
        ->leftJoin('kecamatans', 'pokdakans.kecamatan_id', '=', 'kecamatans.id')
        ->join('categories', 'pokdakans.category_id', '=', 'categories.id')
        ->join('ikans', 'kelompok_ikans.ikan_id', '=', 'ikans.id')
        ->leftJoin('users', 'pokdakans.user_id', '=', 'users.id')
        ->where('pokdakans.status', '=', 'disetujui')
        ->where('ikans.slug', '=', $slug_ikan)
        ->orderByRaw('pokdakans.updated_at DESC')
        ->get();
---
SELECT `pokdakans`.`nama` as `nama_kelompok`, `alamat`, `jumlah_anggota`, `luas_lahan`, `pokdakans`.`updated_at`, `excerpt`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `kecamatans`.`nama` as `kecamatan_nama`, `categories`.`nama` as `category_nama`, `categories`.`slug` as `category_slug`, `users`.`name` as `nama_petugas`, `users`.`username`, `pokdakans`.`id` as `id_kelompok`, `ikans`.`nama` as `ikan_nama`, `ikans`.`slug` as `ikan_slug` FROM `kelompok_ikans` left join `pokdakans` on `kelompok_ikans`.`kelompok_id` = `pokdakans`.`id` left join `kecamatans` on `pokdakans`.`kecamatan_id` = `kecamatans`.`id` inner join `categories` on `pokdakans`.`category_id` = `categories`.`id` inner join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` left join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `pokdakans`.`status` = 'disetujui' and `ikans`.`slug` = 'lele' ORDER BY pokdakans.updated_at DESC