app/Http/Controllers/CategoryController.php

    public function index(Category $category){
        return view('admin/Category/vKategori',[
            'title' => 'DATA KATEGORI',
            'categories' => Category::all()
---
SELECT * FROM `categories`