app/Http/Controllers/DashboardController.php

SELECT count(*) as aggregate FROM `pokdakans`
SELECT count(*) as aggregate FROM `users`
SELECT count(*) as aggregate FROM `users` WHERE `is_admin` = 1
SELECT * FROM `categories`
SELECT * FROM `ikans`
SELECT * FROM `kecamatans`
---
    public function index(Request $request){

        // Cek status Akun
        $is_admin = auth()->user()->is_admin;
        if ($is_admin === 0) {
            Auth::logout();
            $request->session()->invalidate();
            $request->session()->regenerateToken();
            return redirect('/login')->with('statusLoginFailed', 'Status Akun Nonaktif, Hubungi Admin');;
        }
        if ($is_admin === 2) {
            Auth::logout();
            $request->session()->invalidate();
            $request->session()->regenerateToken();
            return redirect('/login')->with('statusLoginPending', 'Status Akun Pengajuan, Hubungi Admin');;
        }
        else{
            return view('admin/vDashboard',[
                        'title'                 => 'DASHBOARD ',
                        'JumlahDataKelompok'    => Pokdakan::count(),
                        'JumlahDataMenunggu'    => count(Pokdakan::all()->where('status','Pengajuan')),
                        'JumlahPetugas'         => User::count(),
                        'JumlahPetugasAktif'    => User::where('is_admin','=',1)->count(),
                        'Categories'            => Category::all(),
                        'Ikans'                 => Ikan::all(),
                        'Kecamatans'            => Kecamatan::all(),