app/Http/Controllers/HomeController.php

SELECT * FROM `categories`
SELECT * FROM `ikans`
SELECT * FROM `kecamatans`
SELECT * FROM `pokdakans` WHERE `status` = 'Disetujui' ORDER BY `created_at` DESC LIMIT 3
---
    public function index()
    {
        return view('frontEnd/vHome', [
        'title'         => 'SIP',
        'Categories'    => Category::all(),
        'Ikans'         => Ikan::all(),
        'Kecamatans'    => Kecamatan::all(),
        'users'         => User::select('username','name')
                        -> whereNotIn('is_admin',[2])
                        -> get(),
        'Datas'         => Pokdakan::latest()
                        -> where('status', '=', 'Disetujui')
                        -> take(3)
                        -> get(),
        'Foto'          => Pokdakan::where('status', '=', 'Disetujui')->latest()->get()

SELECT `id` FROM `pokdakans` ORDER BY `id` DESC LIMIT 1
SELECT `pokdakans`.`nama` as `nama`, `alamat`, `jumlah_anggota`, `luas_lahan`, `pokdakans`.`updated_at`, `pokdakans`.`excerpt`, `total_omzet`, `no_hp`, `pokdakans`.`email`, `prestasi`, `longitude`, `latitude`, `photo`, `pokdakans`.`slug`, `status`, `users`.`name` as `nama_petugas`, `users`.`username` FROM `pokdakans` left join `users` on `pokdakans`.`user_id` = `users`.`id` WHERE `status` = 'Disetujui' ORDER BY updated_at DESC
SELECT `categories`.`nama`, `categories`.`slug` FROM `kelompok_kategoris` left join `categories` on `categories`.`id` = `kelompok_kategoris`.`kategori_id` left join `pokdakans` on `kelompok_kategoris`.`kelompok_id` = `pokdakans`.`id` WHERE `kelompok_id` = 40
SELECT `ikans`.`nama` FROM `kelompok_ikans` left join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` left join `pokdakans` on `kelompok_ikans`.`kelompok_id` = `pokdakans`.`id` WHERE `kelompok_id` = 29
---
    public function DataIndex(Request $request)
    {
        $id_kelompok = DB::table('pokdakans') ->select('id') ->orderByDesc('id')->limit(1)->get();
        $ikan = DB::table('kelompok_ikans')
                    -> select('ikans.nama')
                    -> leftJoin('ikans', 'kelompok_ikans.ikan_id', '=', 'ikans.id')
                    -> leftJoin('pokdakans', 'kelompok_ikans.kelompok_id', '=', 'pokdakans.id')
                    -> where('kelompok_id','=',$id_kelompok[0]->id)
                    -> get();
        $kategori = DB::table('kelompok_kategoris')
                    -> select('categories.nama','categories.slug')
                    -> leftJoin('categories', 'categories.id', '=', 'kelompok_kategoris.kategori_id')
                    -> leftJoin('pokdakans', 'kelompok_kategoris.kelompok_id', '=', 'pokdakans.id')
                    -> where('kelompok_id','=',$id_kelompok[0]->id)
                    -> get();
        return view('frontEnd/vData', [
            'title' => 'Data',
            'ket'   => "Semua Data",
            'Datas' => Pokdakan::select('pokdakans.nama as nama','alamat','jumlah_anggota','luas_lahan',
                          'pokdakans.updated_at','pokdakans.excerpt','total_omzet','no_hp','pokdakans.email',
                          'prestasi','longitude','latitude','photo','pokdakans.slug','status'
                          ,'users.name as nama_petugas','users.username')
                    -> leftJoin('users', 'pokdakans.user_id', '=', 'users.id')
                    -> where('status', '=', 'Disetujui')
                    -> orderByRaw('updated_at DESC')
                    -> get(),
            'Detek' => 'Data',
            'Isi'   => 'Data',
            'ikans' => $ikan,
            'kategoris' => $kategori
        ]);