app/Http/Controllers/IkanController.php

SELECT * FROM `ikans`
---
    public function index(Ikan $ikan)
    {
        return view('admin/Ikan/vIkan',[
            'title'    => 'DATA IKAN',
            'ikans'     => Ikan::all()

UPDATE `ikans` SET `warna` = 'orange', `ikans`.`updated_at` = '2022-06-15 16:10:33' WHERE `id` = 1
---
    public function update(Request $request, Ikan $ikan)
    {
        // return $request;
        $rules = [
            'warna'         => 'required',
        ];
        if ($request->nama != $ikan->nama) {
            $rules['nama']  = 'required|unique:ikans';
        }
        else if ($request->slug != $ikan->slug) {
            $rules['slug']  = 'required|unique:ikans';
        }
        $validatedData                  = $request->validate($rules);
        $validatedData['updated_at']    = now();

        Ikan::where('id',$ikan->id)->update($validatedData);