app/Http/Controllers/PetugasController.php

    public function index()
    {
        return view('admin/petugas/vPetugas',[
        'title'     => 'Petugas',
        'petugas'   => User::all()
---
SELECT * FROM `users`

    public function edit($id)
    {
        $petugas = DB::table('users')->where('id','=', $id)->get();
---
SELECT * FROM `users` WHERE `id` = '7'