app/Http/Controllers/PokdakanController.php

    public function Index(){
        if (auth()->user()->level === 2) {

            return view('admin/kelompok/vKelompok',[
                'title'         => 'KELOMPOK',
                'pokdakans'     => Pokdakan::where('user_id',auth()->user()->id)->orderBy('updated_at','asc')->get(),
                'pokdakanss'    => Pokdakan::latest()
                                            ->where('status', '=', 'Disetujui')
                                            ->where('user_id', '=', auth()->user()->id)
                                            ->get()
            ]);
            // DB::table('pokdakans')->orderBy('updated_at','desc')->get(),
        }else {
            return view('admin/kelompok/vKelompok',[
                'title'         => 'KELOMPOK',
                'pokdakans'     => Pokdakan::latest()->get(),
                'pokdakanss'    => Pokdakan::latest()
                                            ->where('status', '=', 'Disetujui')
                                            ->get()
---
SELECT * FROM `pokdakans` ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3, 6, 7, 9, 10, 16, 20)
SELECT * FROM `pokdakans` WHERE `status` = 'Disetujui' ORDER BY `created_at` DESC

    public function create()
    {
        return view('admin/kelompok/vTambahDataKelompok',[
            'title'         => 'DATA KELOMPOK',
            'Ikans'         => Ikan::pluck('nama','id'),
            'Categories'    => Category::pluck('nama','id'),
            'Desas'         => Desa::all(),
            'Kecamatans'    => Kecamatan::pluck('nama','id')
        ]);
---
SELECT `nama`, `id` FROM `ikans`
SELECT `nama`, `id` FROM `categories`
SELECT * FROM `desas`
SELECT `nama`, `id` FROM `kecamatans`

    public function findDesa(Request $request)
    {
        $data=Desa::select('nama','id')->where('kecamatan_id',$request->id)->get();
---
SELECT `nama`, `id` FROM `desas` WHERE `kecamatan_id` = '4'

        $validatedData['user_id']       = auth()->user()->id;
        $validatedData['excerpt']       = Str::limit(strip_tags($request->latar_belakang),50);

        Pokdakan::create($validatedData);
        $id_kelompok = DB::table('pokdakans') ->select('id') ->orderByDesc('id')->limit(1)->get();
        if($ikan = $request->ikan_id){
                    foreach($ikan as $value){
                       DB::table('kelompok_ikans')->insert(
                            ['kelompok_id' => $id_kelompok[0]->id, 'ikan_id' => $value]
                );
---
INSERT INTO `pokdakans` (`nama`, `slug`, `latar_belakang`, `alamat`, `desa_id`, `kecamatan_id`, `jumlah_anggota`, `luas_lahan`, `total_omzet`, `no_hp`, `email`, `longitude`, `latitude`, `prestasi`, `photo`, `updated_at`, `status`, `user_id`, `excerpt`, `created_at`) VALUES ('Bahagia Pokdakan', 'bahagia-pokdakan', '<div>BAhagia Pokdakan adalagh kljaslkakl;skalshausja;ls<br>&nbsp;asas,aknvajsna.s<br>anjskankslams,as<br><br></div>', 'asnjasbkalsalkhsjhshja;s;\\r\\nkjashkjask;ajskjasajhjbsj', '18', '2', '908', '9089879787', '89089087978989', '+628822184374', 'ti18fataa.0010@gmail.com', '109.65915441513062', '-6.908799882304544', '<ul><li>category_idcategory_id</li><li>category_id</li><li>category_idcategory_id</li><li>category_idcategory_idcategory_id</li></ul>', 'pokdakan-photo/zDctRB92ZAY6ZXsNEz7MkFHWooO1WxGv8jU9BykZ.png', '2022-06-16 12:38:02', 'Pengajuan', 20, 'BAhagia Pokdakan adalagh kljaslkakl;skalshausja;ls...', '2022-06-16 12:38:02')
SELECT `id` FROM `pokdakans` ORDER BY `id` DESC LIMIT 1
INSERT INTO `kelompok_ikans` (`kelompok_id`, `ikan_id`) VALUES (41, '1')

        }
        if($kategori = $request->category_id){
                    foreach($kategori as $value){
                       DB::table('kelompok_kategoris')->insert(
                            ['kelompok_id' => $id_kelompok[0]->id, 'kategori_id' => $value]
                );
---
INSERT INTO `kelompok_kategoris` (`kelompok_id`, `kategori_id`) VALUES (41, '1')

    public function show(Pokdakan $pokdakan)
    {
        // return $pokdakan;
        // return view('admin.vDetailKelompok');
        return view('admin.kelompok.vDetailKelompok',[
            'title'      => 'DETAIL',
            'pokdakan'   => $pokdakan,
            'ikans'      => kelompok_ikan::select('ikans.nama')
                         -> leftJoin('ikans', 'kelompok_ikans.ikan_id', '=', 'ikans.id')
                         -> leftJoin('pokdakans', 'kelompok_ikans.kelompok_id', '=', 'pokdakans.id')
                         -> where('kelompok_id','=',$pokdakan->id)
                         -> get(),
            'kategoris'  => kelompok_kategori::select('categories.nama')
                         -> leftJoin('categories', 'kelompok_kategoris.kategori_id', '=', 'categories.id')
                         -> leftJoin('pokdakans', 'kelompok_kategoris.kelompok_id', '=', 'pokdakans.id')
                         -> where('kelompok_id','=',$pokdakan->id)
                         -> get()
        ]);
---
SELECT `nama`, `id` FROM `categories`
SELECT `nama`, `id` FROM `ikans`
SELECT `ikans`.`nama` FROM `kelompok_ikans` left join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` left join `pokdakans` on `kelompok_ikans`.`kelompok_id` = `pokdakans`.`id` WHERE `kelompok_id` = 38
SELECT `ikan_id`, `ikans`.`nama` FROM `kelompok_ikans` inner join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` WHERE `kelompok_id` = 38

    public function edit(Pokdakan $pokdakan)
    {
        $id_kelompok    = $pokdakan["id"];
        $ikan           =  kelompok_ikan:: where('kelompok_id','=',$id_kelompok)
                        -> select('ikan_id')
                        -> join('ikans', 'kelompok_ikans.ikan_id', '=', 'ikans.id')
                        -> get();
        foreach($ikan as $value){ $jenis_ikan[] = $value->ikan_id; }
        $kategori        =  kelompok_kategori:: where('kelompok_id','=',$id_kelompok)
                        -> select('kategori_id')
                        -> leftJoin('categories', 'kelompok_kategoris.kategori_id', '=', 'categories.id')
                        -> get();
        foreach($kategori as $value){ $jenis_kategori[] = $value->kategori_id; }
        $id_desa         = $pokdakan["desa_id"];
        $id_kecamatan    = $pokdakan["kecamatan_id"];
        $nama_desa       = Desa::where('id','=',$id_desa)->get('nama');

        return view('admin.kelompok.vEditDataKelompok',[
            'title'         => 'EDIT',
            'pokdakan'      => $pokdakan,
            'Ikans'         => Ikan::pluck('nama','id'),
            'Categories'    => Category::pluck('nama','id'),
            'Kecamatans'    => Kecamatan::pluck('nama','id'),
            'Desas'         => Desa::where('kecamatan_id','=',$id_kecamatan)
                            ->pluck('nama','id'),
            'id_desa'       => $id_desa,
            'nama_desa'     => $nama_desa[0]['nama'],
            'id_kecamatan'  => $id_kecamatan,
            'ikans_id'      => $jenis_ikan,
            'kategoris_id'  => $jenis_kategori
        ]);
---
SELECT `ikan_id` FROM `kelompok_ikans` inner join `ikans` on `kelompok_ikans`.`ikan_id` = `ikans`.`id` WHERE `kelompok_id` = 41
SELECT `kategori_id` FROM `kelompok_kategoris` left join `categories` on `kelompok_kategoris`.`kategori_id` = `categories`.`id` WHERE `kelompok_id` = 41
SELECT `nama` FROM `desas` WHERE `id` = 18
SELECT `nama`, `id` FROM `desas` WHERE `kecamatan_id` = 3
SELECT `nama`, `id` FROM `ikans`
SELECT `nama`, `id` FROM `categories`
SELECT `nama`, `id` FROM `kecamatans`
SELECT `nama`, `id` FROM `desas` WHERE `kecamatan_id` = 2

        $validatedData['excerpt']       = Str::limit(strip_tags($request->latar_belakang),50);
        $validatedData['updated_at']    = now();

        Pokdakan::where('id',$pokdakan->id)->update($validatedData);
        if($ikan = $request->ikan_id){
                kelompok_ikan::where('kelompok_id','=',$pokdakan->id)->delete();
                    foreach($ikan as $value){
                       DB::table('kelompok_ikans')->insert(
                            ['kelompok_id' => $pokdakan->id, 'ikan_id' => $value]
                );
---
SELECT * FROM `pokdakans` WHERE `id` in (28)
UPDATE `pokdakans` SET `nama` = 'Bahagia Pokdakan', `latar_belakang` = '<div>BAhagia Pokdakan adalagh kljaslkakl;skalshausja;ls<br>&nbsp;asas,aknvajsna.s<br>anjskankslams,as<br><br></div>', `alamat` = 'asnjasbkalsalkhsjhshja;s;\\r\\nkjashkjask;ajskjasajhjbsj', `desa_id` = '18', `kecamatan_id` = '2', `jumlah_anggota` = '908', `luas_lahan` = '2147483647', `total_omzet` = '2147483647', `no_hp` = '+628822184374', `email` = 'ti18fataa.0010@gmail.com', `longitude` = '109.65915441513062', `latitude` = '-6.908799882304544', `prestasi` = '<ul><li>category_idcategory_id</li><li>category_id</li><li>category_idcategory_id</li><li>category_idcategory_idcategory_id</li></ul>', `status` = 'Pengajuan', `user_id` = 20, `excerpt` = 'BAhagia Pokdakan adalagh kljaslkakl;skalshausja;ls...', `pokdakans`.`updated_at` = '2022-06-16 13:45:40' WHERE `id` = 41
DELETE FROM `pokdakans` WHERE `id` = 28
DELETE FROM `kelompok_ikans` WHERE `kelompok_id` = 41
INSERT INTO `kelompok_ikans` (`kelompok_id`, `ikan_id`) VALUES (41, '1')